// Написать программу которая на вход принимает число и выдает, является ли число четным ( делится ли она на два без остатка).
{
	
	{
	int num = Convert.ToInt32(Console.ReadLine());
    
    if (num % 2 == 0)
       

         Console.WriteLine ("Число четное:");

            
       
    else  
    
     
         Console.WriteLine ( "Число нечетное");
     
	}
}